---
kind: type
id: T:Autodesk.Revit.DB.CurveArrArray
source: html/c9d071fe-9724-42ed-e280-57381cd44301.htm
---
# Autodesk.Revit.DB.CurveArrArray

An array that can contain any type of object.

## Syntax (C#)
```csharp
public class CurveArrArray : APIObject,
	IEnumerable
```